storage/Fluid_Data/rans/ConvDivChannel/Re12600_kOmega_100/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14000
(
(0.097957892923579 1.43832085565984e-06 0)
(0.0976285546231333 7.60806229144861e-06 5.90441676042324e-25)
(0.0973068264731099 6.34698400216422e-06 2.98069318459372e-23)
(0.0970124271978035 6.55913970491883e-06 -2.98075131442222e-23)
(0.0966887492017001 7.14865586968918e-06 5.93319053268805e-25)
(0.0963310557075882 7.38500916737246e-06 5.97448094221567e-23)
(0.0959483129556727 7.71477848249834e-06 -5.7373387590733e-23)
(0.0955341110055074 8.12224835708226e-06 1.94713409575066e-22)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
100
(
(0.0888460774336559 1.34333851993156e-16 0)
(0.263416909228283 -7.47567679686483e-16 0)
(0.400877592112822 -1.32320130346558e-15 0)
(0.488035300106042 -5.48956581490949e-15 0)
(0.54612797752665 -4.58642534768548e-15 0)
(0.588891659847205 -3.98976870971693e-15 0)
(0.622615280556598 -3.1520339409475e-15 0)
(0.650495257185463 -2.60334589024655e-15 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
