storage/Fluid_Data/rans/ConvDivChannel/Re12600_kOmega_100/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
0.000351797332276881
0.000348489544862683
0.000347840856201116
0.000347461750264841
0.000347436855752147
0.000347825792484924
0.000348631590450425
0.000349836729739233
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
0.000259397298278431
0.000609772872373744
0.00280524068047845
0.00441555962369891
0.00518090898396698
0.00557129905095674
0.00578313538184579
0.00589895045605662
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
