storage/Fluid_Data/rans/ConvDivChannel/Re12600_kOmega_100/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
5.84950120689154e-07
5.78223060776842e-07
5.76739041385357e-07
5.76267296144627e-07
5.76946088715474e-07
5.78886651252492e-07
5.82105757913261e-07
5.86570972634056e-07
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 3.00359429643449e-18;
    }
    topWall
    {
        type            calculated;
        value           uniform 3.00359429643449e-18;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.95831097975862e-08
2.91217954518482e-05
8.5405620264675e-05
0.000239081705156721
0.000329937091018581
0.000525992099443492
0.000628079879953251
0.0008363860347726
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
6.48147010540162e-08
7.88212511809895e-05
0.000194133812476159
0.000586589388488713
0.000832191336628882
0.00135979214892901
0.00163157963438884
0.00217882343364589
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
